8evgeny/GIT/Миландр. Standard Peripherals Library/Examples/MDR32F2C10/usb_cdc_echo/MDR32F2C10_usb_device.c
                MDR_USB0->CSR0_TXCSR |= ( 1 << 8 );
            }
//                }
            nextIteration = RESET;
            break;
        }

        /* USB_EP_STALL */
        case USB_EP_STALL:
        {
//                if (!(tmpCTRL & USB_SEP_CTRL_EPRDY))
//                {
            /* EPRDY dropped - event for this End Point */
            if ( ep->EP_Halt == USB_STALL_HALT )
            {
                USB_EP_Stall( EPx, USB_STALL_HALT );
            }
            else
            {
                USB_EP_Idle( EPx );
            }
//                }
            break;
        }
        }
    } while ( nextIteration );

    return result;
}

/**
 * @brief  Prepares EndPoint for IN transaction accepting (service function).
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  DataBitChange: DATA bit handling.
 *         This parameter can be one of the following values:
 *           @arg USB_DATA_BIT_KEEP: Don't change DATA bit.
 *           @arg USB_DATA_BIT_TOGGLE: Toggle DATA0/DATA1.
 *           @arg USB_DATA_BIT_DATA1: Set DATA1.
 *
 * @retval USB_Result.
 */

static void USB_EP_sendInDataPortion( USB_EP_TypeDef EPx, USB_EPData_Bit_TypeDef DataBitChange )
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;
    uint32_t               total;
    uint8_t *              pBuffer;

    assert_param( ep->EP_State == USB_EP_IN );

    /* Copy data portion into TX FIFO buffer */
    total = ( ep->Buffer.IO_Buffer.offset + ep->Buffer.IO_Buffer.bytesToAck < ep->Buffer.IO_Buffer.length ?
              ep->Buffer.IO_Buffer.offset + ep->Buffer.IO_Buffer.bytesToAck : ep->Buffer.IO_Buffer.length );

    pBuffer = ep->Buffer.IO_Buffer.pBuffer;

    USB_SendData( EPx, &pBuffer[ ep->Buffer.IO_Buffer.offset ], total - ep->Buffer.IO_Buffer.offset,
                  DataBitChange );
}


/**
 * @brief  Sets EPRDY and STALL bits (service function).
 *
 * @param  EPx: USB EndPoint number.
 *         This parameter can be one of the following values:
 *         USB_EP0, USB_EP1, USB_EP2, USB_EP3.
 *
 * @param  val: Value for SEPxCTRL register.
 *
 * @retval USB_Result.
 *
 * @note   Before setting EPRDY, the function clears pending
 *         bits (especially SCTDONE), to indicate that previous
 *         transaction is complete.
 */

static void USB_EP_SetReady( USB_EP_TypeDef EPx, uint32_t val )
{
    USB_EPContext_TypeDef *ep = USB_EPContext + EPx;

    /* Clear pending bits */
//    USB_SetSIS(USB_SIS_Msk);

    ep->EP_WasScdone = RESET;

    /* Set CTRL bits */
//    USB_SetSEPxCTRL(EPx, val);
}

/** @} */ /* End of group USB_EndPoint_Private_Functions */

/** @} */ /* End of group USB_EndPoint */

/** @defgroup USB_Device USB Device
 * @{
 */

/** @defgroup USB_Device_Private_Types USB Device Private Types
 * @{
 */

/** @} */ /* End of group USB_Device_Private_Types */

/** @defgroup USB_Device_Private_Constants USB Device Private Constants
 * @{
 */

/** @} */ /* End of group USB_Device_Private_Constants */

/** @defgroup USB_Device_Private_Variables USB Device Private Variables
 * @{
 */

USB_SetupPacket_TypeDef   USB_CurrentSetupPacket;
USB_DeviceContext_TypeDef USB_DeviceContext;
static uint8_t            SetupPacketData[ 2 ];

/** @} */ /* End of group USB_Device_Private_Variables */

/** @defgroup USB_Device_Private_Macros USB Device Private Macros
 * @{
 */

/** @} */ /* End of group USB_Device_Private_Macros */

/** @defgroup USB_Device_Private_FunctionPrototypes USB Device Private Function Prototypes
 * @{
 */

static USB_Result USB_Device_setAddressWork( USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length );

/** @} */ /* End of group USB_Device_Private_FunctionPrototypes */

/** @defgroup USB_Device_Private_Functions USB Device Private Functions
 * @{
 */

/**
 * @brief  Initializes the USB peripheral according to the specified
 *         parameters in the USB_Clock_InitStruct.
 * @param  USB_Clock_InitStruct: pointer to a USB_Clock_TypeDef structure
 *         that contains the configuration information for the USB Clock.
 *
 * @param  USB_DeviceBUSParam: pointer to a USB_DeviceBUSParam_TypeDef structure
 *         that contains the configuration information for the USB BUS
 *
 * @retval USB_Result.
 */

USB_Result USB_DeviceInit( void )
{
    UsbInitCfg_t InitCfg;

    InitCfg.Device   = 1;
    InitCfg.HsEnable = 0;
    InitCfg.ForceHS  = 0;
    InitCfg.ForceFS  = 0;

    USB_Init( &InitCfg );

//    /* Set USB clocks perform controller reset */
//    USB_BRGInit(USB_Clock_InitStruct);
//    USB_Reset();
//    /* Set pulls and Device mode */
//    USB_SetHSCR(USB_HSCR_HOST_MODE_Device);
//    USB_SetHSCR(USB_DeviceBUSParam->PULL);
//    /* Set speed, polarity and enable end points */
//    USB_SetSC(USB_DeviceBUSParam->SPEED | USB_DeviceBUSParam->MODE | USB_SC_SCGEN_Set);
//    /* Setup EP0 */
//    USB_EP_Init(USB_EP0, USB_SEPx_CTRL_EPEN_Enable | USB_SEPx_CTRL_EPDATASEQ_Data1, 0);
    USB_EP_setSetupHandler( USB_EP0, &USB_CurrentSetupPacket, USB_DEVICE_HANDLE_SETUP );

    USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_UNKNOWN;
    USB_DeviceContext.Address         = 0;

    USB_DEVICE_HANDLE_RESET;

    MDR_USB0->INDEX = 0;
    MDR_USB0->FADDR = 0;
    NVIC_EnableIRQ( USB_IRQn );

    return USB_SUCCESS;
}

/**
 * @brief  Enables the USB peripheral.
 *
 * @param  None
 *
 * @retval USB_Result.
 */

USB_Result USB_DevicePowerOn( void )
{
    SetBit( MDR_USB0->POWER, USB_PWR_SFTC_BIT );
    USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_POWERED;

    return USB_SUCCESS;
}

/**
 * @brief  Disables the USB peripheral.
 *
 * @param  None
 *
 * @retval USB_Result.
 */

USB_Result USB_DevicePowerOff( void )
{
    ClearBit( MDR_USB0->POWER, USB_PWR_SFTC_BIT );
    USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_UNKNOWN;

    return USB_SUCCESS;
}

#ifdef USB_REMOTE_WAKEUP_SUPPORTED
/**
 * @brief  Initiates host remote wakeup
 *
 * @param  None
 *
 * @retval USB_Result.
 */

USB_Result USB_DeviceRemoteWakeUp( void )
{
    return USB_SUCCESS;
}
#endif                                                                                                         /* USB_REMOTE_WAKEUP_SUPPORTED */

