8evgeny/GIT/Миландр. Standard Peripherals Library/Examples/MDR32F2C10/usb_cdc_echo/MDR32F2C10_usb_device.c
            MDR_USB0->INDEX       = 0;
            MDR_USB0->CSR0_TXCSR |= ( 1 << USB_CSR0_SRV_RX_PKT_RDY ) | ( 1 << USB_CSR0_DATA_END );
            /* Set special Status Stage handler that will actually change the address */
            USB_DeviceContext.Address = wValue;
            MDR_USB0->CSR0_TXCSR     |= ( 1 << USB_CSR0_FLUSH_FIFO );
            return result;
//            statusAckHandler = USB_Device_setAddressWork;
//            break;
        /* GET_DESCRIPTOR */
        case USB_GET_DESCRIPTOR:
            result = USB_DEVICE_HANDLE_GET_DESCRIPTOR( wValue, wIndex, wLength );
            break;
        /* SET_DESCRIPTOR */
        case USB_SET_DESCRIPTOR:
            result = USB_DEVICE_HANDLE_SET_DESCRIPTOR( wValue, wIndex, wLength );
            break;
        /* GET_CONFIGURATION */
        case USB_GET_CONFIGURATION:
            if ( USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS )
            {
                SetupPacketData[ 0 ] = 0;
            }
            else
            {
                SetupPacketData[ 0 ] = ( uint8_t )USB_DEVICE_HANDLE_GET_CONFIGURATION;
            }
            result = USB_EP_doDataIn( EPx, SetupPacketData, 1, NULL );
            break;
        /* SET_CONFIGURATION */
        case USB_SET_CONFIGURATION:
            if ( wValue == 0 )
            {
                USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_ADDRESS;
            }
            else
            {
                result = USB_DEVICE_HANDLE_SET_CONFIGURATION( wValue );
                if ( result == USB_SUCCESS )
                {
                    USB_DeviceContext.USB_DeviceState = USB_DEV_STATE_CONFIGURED;
                }
            }
            break;
        /* GET_INTERFACE */
        case USB_GET_INTERFACE:
            if ( USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS )
            {
                result = USB_ERROR;
            }
            else
            {
                SetupPacketData[ 0 ] = ( uint8_t )USB_DEVICE_HANDLE_GET_INTERFACE( wIndex );
                result               = USB_EP_doDataIn( EPx, SetupPacketData, 1, NULL );
            }
            break;
        /* SET_INTERFACE */
        case USB_SET_INTERFACE:
            if ( USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS )
            {
                result = USB_ERROR;
            }
            else
            {
                result = USB_DEVICE_HANDLE_SET_INTERFACE( wValue, wIndex );
            }
            break;
        /* SYNCH_FRAME */
        case USB_SYNCH_FRAME:
            if ( USB_DeviceContext.USB_DeviceState == USB_DEV_STATE_ADDRESS )
            {
                result = USB_ERROR;
            }
            else
            {
                result = USB_DEVICE_HANDLE_SYNC_FRAME( wIndex, SetupPacketData );
                if ( result == USB_SUCCESS )
                {
                    result = USB_EP_doDataIn( EPx, SetupPacketData, 2, NULL );
                }
            }
            break;
        default:
            result = USB_ERR_INV_REQ;
        }
        /* If there were no DATA stage, initiate Status Stage (IN ACK) */
        if ( result == USB_SUCCESS && wLength == 0 )
        {
//            if( (USB_SetupPacket->mRequestTypeData & 0x80) != USB_DEVICE_TO_HOST )
//            {
//                MDR_USB0->CSR0_TXCSR |= (1 << 8);
//            }
//            else
//            {
            result = ( USB_SetupPacket->mRequestTypeData & 0x80 ) == USB_DEVICE_TO_HOST ?
                     USB_EP_doDataOut( EPx, 0, 0, statusAckHandler ) :
                     USB_EP_doDataIn( EPx, 0, 0, statusAckHandler );
//            }
        }
        break;
    }
    /* Class-specific request */
    case USB_TYPE_CLASS:
        result = USB_DEVICE_HANDLE_CLASS_REQUEST;
        break;
    /* Vendor-specific request */
    case USB_TYPE_VENDOR:
        result = USB_DEVICE_HANDLE_VENDOR_REQUEST;
        break;
    default:
        result = USB_ERR_INV_REQ;
    }
    return result;
}

/** @} */ /* End of group USB_Device_Private_Handlers */

/** @defgroup USB_Device_deviceSetupPacket_Handlers USB Device Standard Request specific handlers
 * @{
 */

/**
 * @brief  Called on CLEAR_FEATURE request (9.4.1).
 *
 * @param  Recipient: Recipient type (from setup packet header).
 *         This parameter can be one of the following values:
 *         USB_RECIPIENT_DEVICE, USB_RECIPIENT_INTERFACE,
 *         USB_RECIPIENT_ENDPOINT, USB_RECIPIENT_OTHER.
 *
 * @param  wVALUE: Feature selector.
 *
 * @param  wINDEX: Interface or EndPoint number, if Recipient has
 *         appropriate value.
 *
 * @retval USB_Result.
 *
 * @note   This handler is called in correct state only. This implementation
 *         process ENDPOINT_HALT (calling USB_EP_Ready) and DEVICE_REMOTE_WAKEUP
 *         (clearing RemoteWakeupEnabled context flag) standard features only.
 */

USB_Result USB_DeviceClearFeature( USB_RequestRecipient_TypeDef Recipient, uint16_t wVALUE, uint16_t wINDEX )
{
    if ( ( Recipient == USB_RECIPIENT_ENDPOINT ) && ( wVALUE == USB_ENDPOINT_HALT ) )
    {
        return USB_EP_Idle( ( USB_EP_TypeDef )wINDEX );
    }
    else
    {
        return USB_ERROR;
    }
}

/**
 * @brief  Called on SET_FEATURE request (9.4.9).
 *
 * @param  Recipient: Recipient type (from setup packet header).
 *         This parameter can be one of the following values:
 *         USB_RECIPIENT_DEVICE, USB_RECIPIENT_INTERFACE,
 *         USB_RECIPIENT_ENDPOINT, USB_RECIPIENT_OTHER.
 *
 * @param  wVALUE: Feature selector.
 *
 * @param  wINDEX: Interface or EndPoint number, if Recipient has
 *         appropriate value.
 *
 * @retval USB_Result.
 *
 * @note   This handler is called in correct state only. This implementation
 *         process ENDPOINT_HALT (calling USB_EP_Stall) and DEVICE_REMOTE_WAKEUP
 *         (setting RemoteWakeupEnabled context flag) standard features only.
 */

